MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_efm.c
/******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co.,Ltd All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co.,Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file hc32f46x_efm.c
 **
 ** A detailed description is available at
 ** @link EfmGroup EFM description @endlink
 **
 **   - 2018-10-29  1.0  Chengy First version for Device Driver Library of EFM.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f46x_efm.h"
#include "hc32f46x_utility.h"

#if (DDL_EFM_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup EfmGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
#define EFM_LOCK (0x00000000u)
#define EFM_UNLOCK (0x00000001u)
#define EFM_KEY1 (0x0123ul)
#define EFM_KEY2 (0x3210ul)

#define EFM_PROTECT_ADDR_MSK (0x0007FFFFu)

/*  Parameter validity check for pointer. */
#define IS_VALID_POINTER(x) (NULL != (x))

/*  Parameter validity check for flash latency. */
#define IS_VALID_FLASH_LATENCY(x) \
    (((x) == EFM_LATENCY_0) ||    \
     ((x) == EFM_LATENCY_1) ||    \
     ((x) == EFM_LATENCY_2) ||    \
     ((x) == EFM_LATENCY_3) ||    \
     ((x) == EFM_LATENCY_4) ||    \
     ((x) == EFM_LATENCY_5) ||    \
     ((x) == EFM_LATENCY_6) ||    \
     ((x) == EFM_LATENCY_7) ||    \
     ((x) == EFM_LATENCY_8) ||    \
     ((x) == EFM_LATENCY_9) ||    \
     ((x) == EFM_LATENCY_10) ||   \
     ((x) == EFM_LATENCY_11) ||   \
     ((x) == EFM_LATENCY_12) ||   \
     ((x) == EFM_LATENCY_13) ||   \
     ((x) == EFM_LATENCY_14) ||   \
     ((x) == EFM_LATENCY_15))

/*  Parameter validity check for read mode. */
#define IS_VALID_READ_MD(MD) \
    (((MD) == NormalRead) || \
     ((MD) == UltraPowerRead))

/*  Parameter validity check for erase/program mode. */
#define IS_VALID_ERASE_PGM_MD(MD) \
    (((MD) == ReadOnly1) ||       \
     ((MD) == SingleProgram) ||   \
     ((MD) == SingleProgramRB) || \
     ((MD) == SequenceProgram) || \
     ((MD) == SectorErase) ||     \
     ((MD) == MassErase) ||       \
     ((MD) == ReadOnly2) ||       \
     ((MD) == ReadOnly3))

/*  Parameter validity check for flash flag. */
#define IS_VALID_FLASH_FLAG(flag)      \
    (((flag) == EFM_FLAG_WRPERR) ||    \
     ((flag) == EFM_FLAG_PEPRTERR) ||  \
     ((flag) == EFM_FLAG_PGSZERR) ||   \
     ((flag) == EFM_FLAG_PGMISMTCH) || \
     ((flag) == EFM_FLAG_EOP) ||       \
     ((flag) == EFM_FLAG_RWERR) ||     \
     ((flag) == EFM_FLAG_RDY))

/*  Parameter validity check for flash clear flag. */
#define IS_VALID_CLEAR_FLASH_FLAG(flag) \
    (((flag) == EFM_FLAG_WRPERR) ||     \
     ((flag) == EFM_FLAG_PEPRTERR) ||   \
     ((flag) == EFM_FLAG_PGSZERR) ||    \
     ((flag) == EFM_FLAG_PGMISMTCH) ||  \
     ((flag) == EFM_FLAG_EOP) ||        \
     ((flag) == EFM_FLAG_RWERR))

/*  Parameter validity check for flash interrupt. */
#define IS_VALID_EFM_INT_SEL(int) \
    (((int) == PgmErsErrInt) ||   \
     ((int) == EndPgmInt) ||      \
     ((int) == ReadErrInt))

/*  Parameter validity check for flash address. */
#define IS_VALID_FLASH_ADDR(addr) \
    (((addr) == 0x00000000u) ||   \
     (((addr) >= 0x00000001u) &&  \
      ((addr) <= 0x0007FFDFu)))

/*  Parameter validity check for flash address. */
#define IS_VALID_OTP_LOCK_ADDR(addr) \
    (((addr) >= 0x03000FC0u) ||      \
     ((addr) <= 0x03000FF8u))
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

