MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_efm.c
/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief Unlock the flash.
 **
 ** \param None
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void EFM_Unlock(void)
{
    M4_EFM->FAPRT = EFM_KEY1;
    M4_EFM->FAPRT = EFM_KEY2;
}

/**
 *******************************************************************************
 ** \brief Lock the flash.
 **
 ** \param None
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void EFM_Lock(void)
{
    if (EFM_UNLOCK == M4_EFM->FAPRT)
    {
        M4_EFM->FAPRT = EFM_KEY2;
        M4_EFM->FAPRT = EFM_KEY2;
    }
}

/**
 *******************************************************************************
 ** \brief Enable or disable the flash.
 **
 ** \param  [in] enNewState             The new state of the flash.
 ** \arg    Enable                      Enable flash.
 ** \arg    Disable                     Stop flash.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void EFM_FlashCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    M4_EFM->FSTP_f.FSTP = ((Enable == enNewState) ? 0ul : 1ul);
}
/**
 *******************************************************************************
 ** \brief Sets the code latency value..
 **
 ** \param  [in] u32Latency             specifies the FLASH Latency value.
 ** \arg    EFM_LATENCY_0               FLASH 0 Latency cycle
 ** \arg    EFM_LATENCY_1               FLASH 1 Latency cycle
 ** \arg    EFM_LATENCY_2               FLASH 2 Latency cycles
 ** \arg    EFM_LATENCY_3               FLASH 3 Latency cycles
 ** \arg    EFM_LATENCY_4               FLASH 4 Latency cycles
 ** \arg    EFM_LATENCY_5               FLASH 5 Latency cycles
 ** \arg    EFM_LATENCY_6               FLASH 6 Latency cycles
 ** \arg    EFM_LATENCY_7               FLASH 7 Latency cycles
 ** \arg    EFM_LATENCY_8               FLASH 8 Latency cycles
 ** \arg    EFM_LATENCY_9               FLASH 9 Latency cycles
 ** \arg    EFM_LATENCY_10              FLASH 10 Latency cycles
 ** \arg    EFM_LATENCY_11              FLASH 11 Latency cycles
 ** \arg    EFM_LATENCY_12              FLASH 12 Latency cycles
 ** \arg    EFM_LATENCY_13              FLASH 13 Latency cycles
 ** \arg    EFM_LATENCY_14              FLASH 14 Latency cycles
 ** \arg    EFM_LATENCY_15              FLASH 15 Latency cycles
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void EFM_SetLatency(uint32_t u32Latency)
{
    DDL_ASSERT(IS_VALID_FLASH_LATENCY(u32Latency));

    M4_EFM->FRMC_f.FLWT = u32Latency;
}

/**
 *******************************************************************************
 ** \brief Enable or disable the flash instruction cache.
 **
 ** \param  [in] enNewState             The new state of the flash instruction cache.
 ** \arg    Enable                      Enable flash instruction cache.
 ** \arg    Disable                     Disable flash instruction cache.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void EFM_InstructionCacheCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    M4_EFM->FRMC_f.CACHE = enNewState;
}

/**
 *******************************************************************************
 ** \brief Enable or disable the data cache reset.
 **
 ** \param  [in] enNewState             The new state of the data cache reset.
 ** \arg    Enable                      Enable data cache reset.
 ** \arg    Disable                     Disable data cache reset.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void EFM_DataCacheRstCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    M4_EFM->FRMC_f.CRST = enNewState;
}

/**
 *******************************************************************************
 ** \brief Set the flash read mode.
 **
 ** \param  [in] enReadMD               The flash read mode.
 ** \arg    NormalRead                  Normal read mode.
 ** \arg    UltraPowerRead              Ultra_Low power read mode.
 **
 ** \retval None.
 **
 ** \note   None
 **
 ******************************************************************************/
void EFM_SetReadMode(en_efm_read_md_t enReadMD)
{
    DDL_ASSERT(IS_VALID_READ_MD(enReadMD));
    M4_EFM->FRMC_f.SLPMD = enReadMD;
}

/**
 *******************************************************************************
 ** \brief Enable or disable erase / program.
 **
 ** \param  [in] enNewState             The new state of the erase / program.
 ** \arg    Enable                      Enable erase / program.
 ** \arg    Disable                     Disable erase / program.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void EFM_ErasePgmCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    M4_EFM->FWMC_f.PEMODE = enNewState;
}

/**
 *******************************************************************************
 ** \brief Set the flash erase program mode.
 **
 ** \param  [in] enReadMD               The flash erase program mode.
 ** \arg    ReadOnly1                   The flash read only 1.
 ** \arg    SingleProgram               The flash single program.
 ** \arg    SingleProgramRB             The flash single program with read back.
 ** \arg    SequenceProgram             The flash sequence program.
 ** \arg    SectorErase                 The flash sector erase.
 ** \arg    MassErase                   The flash mass erase.
 ** \arg    ReadOnly2                   The flash read only 2.
 ** \arg    ReadOnly3                   The flash read only 3.
 **
 ** \retval None.
 **
 ** \note   None
 **
 ******************************************************************************/
void EFM_SetErasePgmMode(en_efm_erase_pgm_md_t enReadMD)
{
    DDL_ASSERT(IS_VALID_ERASE_PGM_MD(enReadMD));
    M4_EFM->FWMC_f.PEMOD = enReadMD;
}
/**
 *******************************************************************************
 ** \brief Enable or disable the specified interrupt.
 **
 ** \param  [in] enInt                  The specified interrupt.
 ** \arg    PgmErsErrInt                Program erase error interrupt.
 ** \arg    EndPgmInt                   End of Program interrupt.
 ** \arg    ReadErrInt                  Read collided error flag.
 **
 ** \param  [in] enNewState             The new state of the specified interrupt.
 ** \arg    Enable                      Enable the specified interrupt.
 ** \arg    Disable                     Disable the specified interrupt.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void EFM_InterruptCmd(en_efm_int_sel_t enInt, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_VALID_EFM_INT_SEL(enInt));

    switch (enInt)
    {
    case PgmErsErrInt:
        M4_EFM->FITE_f.PEERRITE = enNewState;
        break;
    case EndPgmInt:
        M4_EFM->FITE_f.OPTENDITE = enNewState;
        break;
    case ReadErrInt:
        M4_EFM->FITE_f.RDCOLERRITE = enNewState;
        break;
    default:
        break;
    }
}

/**
 *******************************************************************************
 ** \brief Checks whether the specified FLASH flag is set or not..
 **
 ** \param [in] u32flag                 Specifies the FLASH flag to check.
 ** \arg   EFM_FLAG_WRPERR              Flash write protect error flag.
 ** \arg   EFM_FLAG_PEPRTERR            Flash program protect area error flag.
 ** \arg   EFM_FLAG_PGSZERR             Flash program size error flag.
 ** \arg   EFM_FLAG_PGMISMTCH           Flash program miss match flag.
 ** \arg   EFM_FLAG_EOP                 Flash end of program flag.
 ** \arg   EFM_FLAG_RWERR               Flash read write error flag.
 ** \arg   EFM_FLAG_RDY                 Flash ready flag.
 **
 ** \retval The flash status.
 **
 ** \note   None
 **
 ******************************************************************************/
en_flag_status_t EFM_GetFlagStatus(uint32_t u32flag)
{
    DDL_ASSERT(IS_VALID_FLASH_FLAG(u32flag));

    return ((0ul == (M4_EFM->FSR & u32flag)) ? Reset : Set);
}

/**
 *******************************************************************************
 ** \brief Checks whether the specified FLASH flag is set or not..
 **
 ** \param [in] u32flag                 Specifies the FLASH flag to clear.
 ** \arg   EFM_FLAG_WRPERR              Flash write protect error flag.
 ** \arg   EFM_FLAG_PEPRTERR            Flash program protect area error flag.
 ** \arg   EFM_FLAG_PGSZERR             Flash program size error flag.
 ** \arg   EFM_FLAG_PGMISMTCH           Flash program miss match flag.
 ** \arg   EFM_FLAG_EOP                 Flash end of program flag.
 ** \arg   EFM_FLAG_RWERR               Flash read write error flag.
 **
 ** \retval The flash status.
 **
 ** \note   None
 **
 ******************************************************************************/
void EFM_ClearFlag(uint32_t u32flag)
{
    // DDL_ASSERT(IS_VALID_CLEAR_FLASH_FLAG(u32flag));

