MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_efm.c
    M4_EFM->FSCLR = u32flag;
}
/**
 *******************************************************************************
 ** \brief Get the flash status.
 **
 ** \param None
 **
 ** \retval The flash status.
 **
 ** \note   None
 **
 ******************************************************************************/
en_efm_flash_status_t EFM_GetStatus(void)
{
    en_efm_flash_status_t enFlashStatus = FlashEOP;

    if (1ul == M4_EFM->FSR_f.RDY)
    {
        enFlashStatus = FlashReady;
    }
    else if (1ul == M4_EFM->FSR_f.RDCOLERR)
    {
        enFlashStatus = FlashRWErr;
    }
    else if (1ul == M4_EFM->FSR_f.OPTEND)
    {
        enFlashStatus = FlashEOP;
    }
    else if (1ul == M4_EFM->FSR_f.PGMISMTCH)
    {
        enFlashStatus = FlashPgMissMatch;
    }
    else if (1ul == M4_EFM->FSR_f.PGSZERR)
    {
        enFlashStatus = FlashPgSizeErr;
    }
    else if (1ul == M4_EFM->FSR_f.PEPRTERR)
    {
        enFlashStatus = FlashPgareaPErr;
    }
    else if (1ul == M4_EFM->FSR_f.PEWERR)
    {
        enFlashStatus = FlashWRPErr;
    }
    else
    {
        // else
    }

    return enFlashStatus;
}

/**
 *******************************************************************************
 ** \brief Set flash the windows protect address.
 **
 ** \param  [in] stcAddr                The specified windows protect address.
 ** \arg    StartAddr                   The start of windows protect address.
 ** \arg    EndAddr                     The end of windows protect address.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void EFM_SetWinProtectAddr(stc_efm_win_protect_addr_t stcAddr)
{
    M4_EFM->FPMTSW_f.FPMTSW = (stcAddr.StartAddr & EFM_PROTECT_ADDR_MSK);
    M4_EFM->FPMTEW_f.FPMTEW = (stcAddr.EndAddr & EFM_PROTECT_ADDR_MSK);
}

/**
 *******************************************************************************
 ** \brief Set bus state while flash program & erase.
 **
 ** \param  [in] enState                The specified bus state while flash program & erase.
 ** \arg    BusBusy                     The bus busy.
 ** \arg    BusRelease                  The bus release.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void EFM_SetBusState(en_efm_bus_sta_t enState)
{
    M4_EFM->FWMC_f.BUSHLDCTL = enState;
}

/**
 *******************************************************************************
 ** \brief Flash single program without read back.
 **
 ** \param  [in] u32Addr                The specified program address.
 ** \param  [in] u32Data                The specified program data.
 **
 ** \retval en_result_t
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t EFM_SingleProgram(uint32_t u32Addr, uint32_t u32Data)
{
    en_result_t enRet = Ok;
    uint8_t u8tmp;
    uint16_t u16Timeout = 0u;

    DDL_ASSERT(IS_VALID_FLASH_ADDR(u32Addr));

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_WRPERR | EFM_FLAG_PEPRTERR | EFM_FLAG_PGSZERR |
                  EFM_FLAG_PGMISMTCH | EFM_FLAG_EOP | EFM_FLAG_RWERR);

    /* read back CACHE */
    u8tmp = (uint8_t)M4_EFM->FRMC_f.CACHE;

    M4_EFM->FRMC_f.CACHE = Disable;

    /* Enable program. */
    EFM_ErasePgmCmd(Enable);
    /* Set single program mode. */
    EFM_SetErasePgmMode(SingleProgram);
    /* program data. */
    *(uint32_t *)u32Addr = u32Data;

    while (1ul != M4_EFM->FSR_f.RDY)
    {
        u16Timeout++;
        if (u16Timeout > 0x1000u)
        {
            enRet = ErrorTimeout;
        }
    }

    if (u32Data != *(uint32_t *)u32Addr)
    {
        enRet = Error;
    }

    EFM_ClearFlag(EFM_FLAG_EOP);
    /* Set read only mode. */
    EFM_SetErasePgmMode(ReadOnly1);
    EFM_ErasePgmCmd(Disable);

    /* recover CACHE */
    M4_EFM->FRMC_f.CACHE = u8tmp;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Flash single program with read back.
 **
 ** \param  [in] u32Addr                The specified program address.
 ** \param  [in] u32Data                The specified program data.
 **
 ** \retval en_result_t
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t EFM_SingleProgramRB(uint32_t u32Addr, uint32_t u32Data)
{
    en_result_t enRet = Ok;
    uint8_t u8tmp = 0u;
    uint16_t u16Timeout = 0u;

    DDL_ASSERT(IS_VALID_FLASH_ADDR(u32Addr));

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_WRPERR | EFM_FLAG_PEPRTERR | EFM_FLAG_PGSZERR |
                  EFM_FLAG_PGMISMTCH | EFM_FLAG_EOP | EFM_FLAG_RWERR);

    /* read back CACHE */
    u8tmp = (uint8_t)M4_EFM->FRMC_f.CACHE;

    M4_EFM->FRMC_f.CACHE = Disable;

    /* Enable program. */
    EFM_ErasePgmCmd(Enable);
    /* Set single program with read back mode. */
    EFM_SetErasePgmMode(SingleProgramRB);
    /* program data. */
    *(uint32_t *)u32Addr = u32Data;

    while (1ul != M4_EFM->FSR_f.RDY)
    {
        u16Timeout++;
        if (u16Timeout > 0x1000u)
        {
            enRet = ErrorTimeout;
        }
    }

    if (1ul == M4_EFM->FSR_f.PGMISMTCH)
    {
        enRet = Error;
    }

    EFM_ClearFlag(EFM_FLAG_EOP);
    /* Set read only mode. */
    EFM_SetErasePgmMode(ReadOnly1);
    EFM_ErasePgmCmd(Disable);

    /* recover CACHE */
    M4_EFM->FRMC_f.CACHE = u8tmp;

    return enRet;
}

static void *EFM_Memcpy(void *pvDst, void *pvSrc, uint32_t u32Count)
{
    uint8_t *u8TmpDst = (uint8_t *)pvDst;
    uint8_t *u8TmpSrc = (uint8_t *)pvSrc;

    DDL_ASSERT(IS_VALID_POINTER(pvDst));
    DDL_ASSERT(IS_VALID_POINTER(pvSrc));

    while (u32Count--)
    {
        *u8TmpDst++ = *u8TmpSrc++;
    }

    return pvDst;
}
/**
 *******************************************************************************
 ** \brief Flash sequence program.
 **
 ** \param  [in] u32Addr                The specified program address.
 ** \param  [in] u32Len                 The len of specified program data.
 ** \param  [in] *pBuf                  The pointer of specified program data.
 **
 ** \retval en_result_t
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t EFM_SequenceProgram(uint32_t u32Addr, uint32_t u32Len, void *pBuf)
{
    en_result_t enRet = Ok;
    uint8_t u8tmp;
    uint32_t i;
    uint16_t u16Timeout = 0u;
    uint32_t u32Tmp = 0xFFFFFFFFul;
    // uint32_t *u32pSrc = pBuf;
    uint32_t *u32pSrc = (uint32_t *)pBuf;
    uint32_t *u32pDest = (uint32_t *)u32Addr;
    uint32_t u32LoopWords = u32Len >> 2ul;
    uint32_t u32RemainBytes = u32Len % 4ul;

